Revit 2024 API
FamilyInstance.ExtensionUtility Property
Property to check whether the instance can be extended and return the interface for extension operation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public IExtension ExtensionUtility { get; }
Visual Basic
Public ReadOnly Property ExtensionUtility As IExtension
	Get
Visual C++
public:
property IExtension^ ExtensionUtility {
	IExtension^ get ();
}
Remarks
If the family instance can not support extension operation, it returns null
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace